abandon
abroad
abrupt
absence
absorb
absurd
abyss
accident
accompany
accomplish
accord
accurate
accurse
accustom
achieve
acknowledge
acquaint
acquaintance
active
activity
admiration
admire
adult
advance
advantage
adventure
advice
advise
affair
affect
affection
affectionate
afford
agent
agony
agree
agreeable
aid
aim
alas
alien
alley
aloud
alter
altogether
amaze
amazement
america
american
amiable
amid
amidst
amongst
amount
amuse
anger
angle
ankh
ankle
announce
annoy
anxiety
anyhow
anymore
anywhere
apartment
appeal
apple
apply
appoint
apprehension
arch
area
argue
argument
arise
armor
army
arrange
arrangement
arrest
arrival
arrow
article
artist
ash
ashamed
aspect
assemble
assistant
associate
assume
astonish
astonishment
atmosphere
attach
attend
attendant
attic
attitude
attract
audience
auditor
august
authority
autumn
avenue
await
awaken
awkward
axe
baby
background
backward
badge
balance
bald
balloon
band
bang
bargain
bark
barnacle
barrel
base
basil
basket
bat
bath
bathroom
batter
bay
beach
beam
bearer
beast
beckon
bed
bedroom
bee
beer
behave
behold
being
belief
bellow
belt
bench
bet
betray
bewilder
bid
bigger
bile
birth
birthday
bit
bitter
blackness
blade
blame
blank
blanket
blast
blaze
bleed
blink
block
bloody
blossom
blur
blush
bob
boil
bold
bolt
bomb
bonnet
boom
border
bore
borrow
bosom
bother
bounce
bowl
brandy
brass
brave
bread
breathe
breathless
breeze
brick
brilliant
brisk
british
bronze
brood
broom
broomstick
brow
brush
bubble
buck
bug
building
bulge
bullet
bunch
bundle
burden
bus
bush
butter
button
buzz
bye
cabin
cable
cage
cake
camera
camp
cap
capable
capital
capture
career
careless
carpet
carriage
cart
carve
casual
cauldron
caution
cautious
cavern
cease
cell
cellar
center
central
centre
ceremony
champion
channel
chant
chap
chase
chatter
cheap
cheer
cheerful
chew
chicken
chill
chimney
chin
chocolate
choice
choke
christmas
chuckle
churchyard
cigar
cigarette
citizen
clad
claim
clang
clap
clasp
classroom
clatter
claw
clench
clerk
clever
click
cling
cloth
club
clue
clumsy
cluster
coach
coal
coast
cock
code
coffee
coffin
coil
coin
collapse
collar
collect
college
colon
colonel
color
column
comment
commit
communication
compare
complain
complex
complicate
compliment
computer
comrade
conceal
concentrate
conclude
conclusion
conduct
confess
confidence
confirm
confuse
confusion
connect
connection
conscious
consciousness
consent
consequence
considerable
consideration
constant
consult
contact
content
contrary
convey
convince
cook
cop
copy
corp
corpse
correct
cost
cottage
cough
council
counsel
countenance
counter
courage
cousin
cow
crackle
craft
crash
crazy
creak
cream
credit
crew
crime
criminal
crook
cruel
crumble
crush
crystal
cunning
cupboard
cur
cure
curiosity
curl
current
curtain
curve
custom
dad
dale
damage
damn
damp
dan
darken
darling
dart
dash
data
date
david
daylight
dean
debate
decay
deceive
decent
decision
deck
declare
deed
defeat
defend
defense
definite
degree
delay
delicate
delightful
deliver
demand
demon
den
deny
depart
department
departure
depend
depress
depth
descend
describe
description
deserve
design
despair
despite
detect
determine
develop
device
devil
devote
diary
dick
difference
difficulty
dignity
dimension
din
dip
dirty
disappoint
disappointment
discovery
discuss
discussion
disease
disguise
disgust
dish
dislike
dismal
dismiss
display
dispose
distinct
distinguish
distract
distress
div
divide
dizzy
dollar
doom
doorway
dormitory
dot
doubtful
downstairs
downward
doze
drain
draught
drawer
drip
driver
droop
drown
drug
drum
dublin
duchess
duck
due
duke
dull
dungeon
dusk
dusty
dye
eager
eagle
earn
earnest
ease
eastern
eastward
eater
edward
egg
elbow
elder
electric
element
eleven
elsewhere
embarrass
embrace
emerge
emotion
employ
encounter
encourage
endless
endure
energy
engage
engine
england
english
enormous
entertain
entity
envelope
equal
equipment
ere
ernest
errand
establish
estate
eventual
everywhere
evidence
example
exceeding
excellent
exchange
excitement
exclaim
exercise
exhaust
exist
existence
expedition
expensive
experiment
explanation
explode
explore
explosion
expose
extend
extent
extra
extraordinary
eyebrow
faith
faithful
famous
fan
fang
fantastic
farewell
farm
farmer
farther
fascinate
fasten
faster
fate
fault
favour
favourite
fearful
feast
feather
feature
feeble
feeling
female
fence
fetch
fever
fierce
fifteen
fifth
filch
file
fir
firebolt
fireplace
fist
flag
flap
flare
flee
fleet
flesh
flicker
fling
flood
flora
flush
flutter
focus
foe
fog
fond
foolish
footstep
forbid
ford
forehead
foreign
forever
forgive
fork
former
fortunate
fortune
forty
foul
fountain
fourth
fragment
frame
frank
frantic
freedom
freeze
french
frequent
friendship
fright
frightful
fro
frog
frown
fruit
fry
fudge
fully
fumble
fun
funeral
funny
fur
furious
furniture
fury
gain
galaxy
gallop
gang
gap
gas
gaunt
gay
gaze
gear
generation
generous
genius
genuine
german
gesture
ghastly
ghoul
giant
gift
gigantic
glare
glide
glimmer
glint
glisten
glitter
gloom
gloomy
glory
glove
goblet
goblin
goodness
goose
government
gown
grace
graceful
gracious
gradual
grand
grandfather
grant
grasp
grateful
gratitude
greet
grief
grim
grip
grippe
groan
grope
grotesque
grove
growl
grumble
grunt
guest
guilty
gulf
guy
habit
hail
halfway
ham
hammer
handful
handkerchief
handsome
happiness
harder
hark
harm
harmony
harsh
haste
hasten
hasty
hate
haul
haunt
heal
health
healthy
heap
hearty
heat
heave
hedge
heel
height
heir
hello
helm
helmet
helpless
hero
hesitate
hey
higher
highest
hire
hoarse
holiday
hollow
honest
hood
hook
hopeful
hopeless
horizon
hospital
host
hotel
hover
howl
huddle
hug
hum
humble
hungry
hunt
hunter
hurl
hurried
hush
hut
ice
icy
idiot
idle
ignore
image
imagination
immense
imp
impatient
importance
impress
impression
impressive
improve
incident
incline
include
increase
incredible
indicate
indifferent
individual
infinite
influence
inform
injury
ink
inn
inner
innocent
inquire
inquiry
insect
insist
inspire
instance
instinct
instruction
instrument
insult
intelligence
intend
intense
intent
intention
interrupt
interval
interview
introduce
invent
investigation
invisible
invite
involve
ireland
irish
island
issue
italian
item
jack
jacket
jail
jar
jaw
jerk
jet
jewel
joke
jordan
journal
joy
jug
justice
keen
keeper
kindle
kindness
king
kingdom
kitty
kneel
knight
knot
laboratory
labour
lack
lad
ladder
landscape
lane
lantern
lap
lash
latter
laughter
launch
lawn
lawyer
lazy
leader
leaf
league
leather
legend
lend
lesson
lest
lett
liberty
librarian
license
lick
lid
lighter
lightning
likewise
limb
limit
limp
linger
link
lion
list
load
local
lodge
lofty
log
lone
loom
lore
loss
lover
luck
lucky
lump
lunch
lurk
madness
magical
maid
mail
maintain
majesty
major
male
mankind
mansion
map
marble
market
marriage
marsh
marvel
marvellous
mask
mass
massive
material
meal
meanwhile
measure
meat
mechanical
medical
melt
member
menace
mend
mental
merchant
mercy
mess
messenger
method
midnight
midst
mild
military
milk
mill
mingle
minister
ministry
mirror
miserable
misery
mission
mistake
mistaken
mistress
misty
mix
moan
mock
model
modern
mom
monday
monk
monkey
monsieur
monster
monstrous
mood
moonlight
moral
morrow
mortal
motion
motive
motor
mound
mount
mouse
mud
muffle
mum
mumble
murder
muscle
museum
musical
myrtle
mysterious
mystery
myth
nail
nameless
nasty
national
native
nay
nearby
nearest
neat
needle
neighbourhood
nephew
nerve
net
nevertheless
newspaper
nick
niece
nigger
nigh
nightmare
noble
non
nonsense
noon
northern
northward
nostril
notion
nowhere
nurse
oak
obey
objection
oblige
obscure
observation
obtain
occupy
ocean
october
odour
offend
official
oil
okay
older
operate
operation
opportunity
orange
ordinary
organ
original
otherwise
ourself
outer
outline
overcome
overhead
owl
owner
oxford
pace
pad
painful
palace
palm
pan
panel
panic
pant
papa
parchment
pardon
park
parlour
partner
passe
passion
passionate
pat
patch
patience
patient
patrician
pattern
pavement
paw
peaceful
peak
peculiar
peep
peeve
pen
pencil
per
perceive
perch
perform
performance
peril
period
perish
permission
permit
personality
persuade
pet
peter
petunia
photograph
phrase
physical
physician
pie
pierce
pig
pillar
pillow
pilot
pin
pinch
pine
pink
pipe
pirate
pit
pitch
pity
plane
plant
plastic
platform
player
plenty
plot
plunge
poet
poison
poke
pole
polish
polite
ponder
pont
pony
pool
pop
port
portrait
pose
positive
possess
possession
possibility
pot
potato
potion
powder
powerful
practical
practice
praise
prayer
precious
precise
prefer
preparation
preserve
president
pressure
prevent
previous
prey
price
pride
prince
principal
principle
print
prison
prisoner
proceed
process
profession
professional
profound
program
progress
project
prompt
proof
property
propose
prospect
protect
protection
protest
provide
pry
puff
punch
punish
purchase
pure
purple
pursue
pursuit
puzzle
quality
quarrel
quest
quill
quiver
rabbit
rack
radio
raft
rag
rage
rail
range
rank
rapid
rare
rate
rattle
ray
reader
reality
realm
rear
reasonable
recent
recognize
recollect
recollection
recover
reduce
reef
refer
reference
reflect
reflection
refresh
refuse
region
regret
regular
relate
relation
relative
relax
release
relief
relieve
reluctant
remarkable
remembrance
remind
remote
render
rent
rep
repair
replace
represent
request
require
rescue
research
reserve
resist
resolution
resolve
respectable
respond
response
restless
restore
resume
retire
retreat
reward
rib
riddle
ridge
ridiculous
rifle
rim
rip
risk
rob
robot
roger
root
rot
rouse
route
royal
rude
rumble
russian
rustle
rusty
sack
sacred
sacrifice
safety
sail
sailor
sake
salt
salute
sand
satisfaction
satisfy
saturday
savage
sawyer
scale
scarce
scarlet
scatter
scent
scheme
scholar
science
scientific
score
scowl
scramble
scrap
scratch
screw
seal
season
section
secure
security
seldom
sensation
sensible
sentence
separate
september
sergeant
serpent
severe
sex
shade
shadowy
shaft
shallow
shame
shatter
shave
shawn
shed
sheep
sheer
sheet
shelf
shell
shelter
shelve
sherlock
shield
shift
shimmer
shirt
shiver
shoe
shove
shower
shriek
shrill
shrug
shudder
shuffle
shutter
sick
sideway
signal
silk
similar
sin
singular
sinister
sip
situation
sixty
skill
skirt
skull
slab
slam
slant
slap
slave
slay
sleepy
sleeve
slice
slide
slop
smaller
smart
smash
snake
snarl
snatch
sneak
sneer
sniff
snore
snort
soak
soar
sob
social
sock
sofa
soften
soil
soldier
sole
solemn
solid
solitary
solution
somebody
somewhat
sooner
sore
sorrow
soup
source
southern
southward
spare
spark
sparkle
sparkler
speaker
spear
specimen
spectacle
specter
spider
spin
spite
splash
splendid
split
spoon
sport
sprawl
spray
squat
squeak
squeeze
squint
stab
stable
stack
staff
stage
stagger
stain
staircase
stalk
stamp
standard
stare
startle
starve
statement
statue
steam
steel
steep
steeple
steer
stern
steward
stiff
stock
stomach
stony
stool
stoop
store
storm
stout
straighten
strain
strap
straw
stray
stre
strict
stride
strip
stroke
stroll
structure
stumble
stun
style
substance
subtle
succeed
success
successful
suck
sufficient
sugar
suggestion
sullen
sum
summon
sunday
sunlight
sunset
superior
supper
supple
supply
support
suppress
supreme
surround
survey
survive
suspect
suspicion
suspicious
swallow
swarm
sway
swear
sweat
sweeper
swell
swim
swirl
switch
swoop
symbol
sympathy
system
talent
tangle
taste
teach
teacher
team
telephone
temper
temple
temporary
tempt
tend
tender
tense
tent
terrace
terrify
terrorist
test
thee
theory
thief
thieve
thirteen
thomas
thorough
thou
thoughtful
thread
threat
threaten
throb
throne
thrust
thud
thumb
thump
thunder
thy
tick
ticket
tide
tidings
timid
tin
title
toast
toe
tomb
tool
torch
torment
torture
toss
total
tough
tournament
toy
trade
tradition
traffic
trail
trap
traveller
tray
tread
treasure
treat
tremendous
trial
trick
trickle
trifle
trip
triumph
troll
troop
trot
trouser
truck
tube
tuck
tug
tumble
tune
twelve
twilight
twin
twinkle
twitch
type
ultimate
unable
uncertain
uncomfortable
unconscious
underground
underneath
undoubted
uneasy
unexpected
unfortunate
unhappy
unicorn
uniform
union
unit
universal
universe
university
unlike
unlock
unpleasant
unseen
unusual
upper
upright
upset
upstairs
upward
urge
urgent
useful
useless
utmost
vain
valentine
value
variety
vary
vault
veil
vein
velvet
venture
victim
victory
violent
violet
virtue
visible
vision
visitor
vital
vivid
volume
wade
wail
waist
waistcoat
waiter
wan
warmth
warrior
wary
waste
watcher
watson
wax
weakness
wealth
weather
weave
web
wed
weep
weigh
weird
western
westward
wet
whence
whenever
wherever
whilst
whip
whirl
whistle
whoever
wick
widow
william
willow
wink
winter
wipe
wire
wisdom
wit
wither
witness
wobbler
wolf
wooden
worm
worship
worthy
wrap
wreck
wrench
wretch
wrinkle
wrist
writhe
wrought
yawn
yesterday
yield
younger
zero